Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཡབ་ཡུམ་བདག་དགེ་སྦྱོང་གཽ་ཏ་མའི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དུ་མཆིའོ་ཞེས་བྱས་ནས་སོང་ངོ་། །
en: “Mother, Father, I am going to practice the holy life in the presence of the ascetic Gautama,” and departed.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཏུ་འགྲོ་ཞེས་བྱས་ནས་དེས་དེར་གཅེར་བུ་པ་གཉེན་གྱི་བུ་མཐོང་ནས་
en: He went to Rājagṛha as he had said, and there saw the naked saint Nirgrantha Jñātiputra.

source: དེས་བསམ་པ། དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་འདི་ཡིན་ནོ་སྙམ་ནས། དེ་དེའི་ཐད་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: He thought, “There he is—the ascetic Gautama!” and went forth in his presence.

source: རབ་ཏུ་བྱུང་ནས་ཀྱང་དེས་ལྟས་ཀྱི་དཔྱད་ལོབས་ནས། དེ་དེ་ལ་སློབ་དཔོན་གྱི་མཆོག་ཏུ་གྱུར་ཏོ། །
en: After he went forth and studied their system of telling signs, Nirgrantha Jñātiputra became the foremost of his teachers.

source: དེ་ནས་དེའི་མིང་འོད་སྲུང་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་མེད་པར་གྱུར་ཏེ། མིང་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: From that point on he was no longer known as Kāśyapa , and he took the name Nirgrantha Kinsman of the Kāśyapas.

source: ཕྱི་ཞིག་ན་དེས་བདག་ཉིད་ཚེ་ཟད་པའི་རྟགས་མཐོང་ནས་བསམས་པ།
en: One day he saw the indications that he was near the end of his life, and he thought,

source: བདག་ནི་ཞག་བདུན་ན་མེད་པར་འགྱུར་རོ་སྙམ་མོ། །
en: “In seven days I shall be no more.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དགའ་བའི་ལྷས་དེ་ལ་སྦྲན་ཏེ།
en: A deity who delighted in the doctrine of the Blessed One told him,

source: གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ། མི་དགར་མ་བྱེད་ཅིག །
en: “Don’t despair, Nirgrantha Kinsman of the Kāśyapas.

source: བཅོམ་ལྡན་འདས་དེ་ནི་འཆི་བ་ལས་ངེས་པར་འབྱུང་བར་འགྱུར་བའི་ལམ་སྟོན་པ་ཡིན་ཏེ།
en: The Blessed One teaches the path of definite escape from death.

source: དེ་ནི་རྒྱལ་པོའི་ཁབ་འདི་ཉིད་ན་བཞུགས་ཀྱིས།
en: And he’s staying right here in Rājagṛha.

source: དེ་ལ་བསྙེན་བཀུར་གྱིས་ཤིག །
en: Offer him your respect and service.

source: དེ་ལྟར་བྱས་དང་ཁྱོད་ལ་ལེགས་པར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: If you do, things will go well for you.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་རྒྱལ་པོའི་ཁབ་ནས་བྱུང་སྟེ། འོད་མའི་ཚལ་ལོགས་སུ་ཆས་པ་ལས།
en: Nirgrantha Kinsman of the Kāśyapas left Rājagṛha as soon as he heard this and set out for Bamboo Grove.

source: ལམ་ཕྱེད་དུ་དེའི་བློ་སྐྱེས་པ།
en: On the way he thought,

source: དགེ་སློང་རྣམས་ནི་ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ཡིན་ལ།
en: “Monks are modest and shy.

source: བདག་ནི་གཅེར་བུར་འདུག་པས་ན། དེ་དག་དང་མངོན་སུམ་དུ་ཕྲད་དུ་འགྲོ་མི་ཕོད་ཀྱིས། བདག་རེ་ཞིག་འོད་མའི་ཚལ་དུ་མི་འགྲོ་བར།
en: Since I am a naked ascetic, I would not dare go and meet them in person, so I won’t go to Bamboo Grove quite yet.

source: ལམ་ཕྱེད་འདི་ཉིད་དུ་འདུག་པར་བྱའོ། །
en: Instead, I’ll remain here at the halfway point.

source: ལམ་ཕྱེད་འདི་ཉིད་དུ་འདུག་བཞིན་དུ་བདག་གིས་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་བསྙེན་བཀུར་བྱའོ་སྙམ་མོ། །
en: Staying here, just halfway, I shall offer the ascetic Gautama my respect and service.”

source: སུ་ནི་ཕོངས་པ་དང་། ཉམ་ང་བ་དང་། གནོད་པ་དང་ལྡན།
en: Who is destitute, in a dreadful state, and being harmed?

source: སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེ། མཐོ་རིས་དང་། ཐར་པ་དང་། འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་གདུལ་བའི་དུས་ལ་བབ་བོ་སྙམ་དུ་དགོངས་ནས།
en: When the Blessed One focused his mind, he realized that the time had come to tame Nirgrantha Kinsman of the Kāśyapas,

source: འོད་མའི་ཚལ་ནས་བྱུང་སྟེ། ས་ཕྱོགས་གང་ན་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་འདུག་པའི་ས་ཕྱོགས་དེར་གཤེགས་ནས།
en: so he left Bamboo Grove and went to see Nirgrantha Kinsman of the Kāśyapas.

source: གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས་ཐག་རིང་པོ་ཞིག་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: When Nirgrantha Kinsman of the Kāśyapas saw the Blessed Buddha from a distance he approached the Blessed One,

source: བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་ཏུ་མངོན་སུམ་དུ་ཡང་དག་པར་མགུ་བ་དང་། ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་གཏམ་སྣ་ཚོགས་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: and when he arrived he made all manner of entertaining and jovial conversation with him and then took a seat at one side.

source: དེ་ནས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Nirgrantha Kinsman of the Kāśyapas requested the Blessed One,

source: ཀྱེ་གཽ་ཏ་མ་གལ་ཏེ་ཞུས་ནས། ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་སྐབས་ཕྱེ་ན། གཽ་ཏ་མ་ཁྱོད་ལ་འདི་ཉིད་དུ། ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “Gautama, should there be an opportunity for you to answer questions, I would like to ask you about a few matters.”

source: འོད་སྲུང་རེ་ཞིག་ང་རྒྱལ་པོའི་ཁབ་ཏུ་བསོད་སྙོམས་ལ་འགྲོ་དགོས་པས།
en: “ Kāśyapa , I have to go to Rājagṛha for a while for alms.

source: ཁྱོད་ཀྱིས་ཞུ་བ་ལུང་བསྟན་པའི་སྐབས་སུ་མ་བབ་ཀྱིས།
en: This is not the time for me to answer your questions.

source: ཀུན་དགའ་ར་བའི་ཕྱིར་རོལ་དུ་ཤོག་ཤིག་དང་དེར་ཁྱོད་ཀྱི་ཞུ་བ་ལུང་བསྟན་པའི་སྐབས་སུ་བབ་བོ། །
en: Wait outside the grove and an opportunity will come for me to answer your questions.”

source: གསོལ་པ། ཀྱེ་མ་གཽ་ཏ་མ་གལ་ཏེ་བདག་ཀྱང་གཞན་དུ་འགྱུར་སྲིད་ལ། ཡང་ན་གཽ་ཏ་མ་གཞན་དུ་འགྱུར་ཡང་སྲིད་དོ། །
en: “Gautama,” he replied, “if it’s possible for me to change my mind, then perhaps it’s possible that Gautama may change his mind as well.”

source: དེ་བཞིན་དུ་ལན་གཉིས་ལན་གསུམ་དུ། གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས་གསོལ་པ།
en: So Nirgrantha Kinsman of the Kāśyapas beseeched him a second and third time,

source: གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་སྐབས་ཕྱེ་ན། གཽ་ཏ་མ་ཁྱོད་ལ་འདི་ཉིད་དུ་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “Should there be an opportunity for you to answer questions, I would like to ask you about a few matters.”

source: དེ་ནས་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: And the second and third time, the Blessed One told Nirgrantha Kinsman of the Kāśyapas,

source: ཀུན་དགའ་ར་བའི་ཕྱི་རོལ་དུ་ཤོག་ཤིག་དང་། དེར་ཁྱོད་ཀྱི་ཞུ་བ་ལུང་བསྟན་པའི་སྐབས་སུ་བབ་བོ། །
en: but wait outside of the grove a bit and the opportunity for me to answer your questions will come.”

source: གསོལ་པ། ཀྱེ་གཽ་ཏ་མ་གལ་ཏེ་ཞུས་ནསཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་སྐབས་ཕྱེ་ན། གཽ་ཏ་མ་ཁྱོད་ལ་འདི་ཉིད་དུ་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “Gautama,” he persisted, “should there be an opportunity for you to answer questions, I would like to ask you about a few matters.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་ཁྱོད་དོན་འདི་ཉིད་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ་ངེས་པར་གླེང་བར་བྱེད་ན་ནི།
en: “ Kāśyapa ,” the Blessed One replied, “a second and a third time you have insisted on discussing this.

source: འོད་སྲུང་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་ཞུས་ཤིག །
en: Inquire about whatever you wish, Kāśyapa .”

source: གསོལ་པ། གཽ་ཏ་མ་ཅི་ལགས། སྡུག་བསྔལ་རང་གིས་བགྱིས་སམ།
en: “Tell me, Gautama, is suffering created by itself?” he asked.

source: བཀའ་སྩལ་པ། འོད་སྲུང་སྡུག་བསྔལ་རང་གིས་བྱས་སོ་ཞེས་ངས་མ་བཤད་དོ། །
en: “ Kāśyapa , I have not proclaimed that suffering is created by itself,” the Blessed One replied.

source: ཀྱེ་གཽ་ཏ་མ་ཅི་ལགས། སྡུག་བསྔལ་གཞན་གྱིས་བགྱིས་སམ།
en: “Tell me, Gautama, is suffering created by another?”

source: འོད་སྲུང་སྡུག་བསྔལ་གཞན་གྱིས་བྱས་ཞེས་བྱ་བ་དེ་ནི་ངས་ལུང་མ་བསྟན་ཏོ། །
en: “ Kāśyapa , I have not proclaimed that suffering is created by another.”

source: ཀྱེ་གཽ་ཏ་མ་ཅི་ལགས། སྡུག་བསྔལ་རང་གིས་ཀྱང་བགྱིས་ལ་གཞན་གྱིས་ཀྱང་བགྱིས་པ་ལགས་སམ།
en: “Tell me, Gautama, is suffering created both by itself and by another?”

source: འོད་སྲུང་སྡུག་བསྔལ་རང་གིས་ཀྱང་བྱས་པ་དང་གཞན་གྱིས་ཀྱང་བྱས་ཞེས་བྱ་བ་དེ་ཡང་ངས་ལུང་མ་བསྟན་ཏོ། །
en: “ Kāśyapa , I have not proclaimed that suffering is created both by itself and by another.”

source: ཀྱེ་གཽ་ཏ་མ་ཅི་ལགས།
en: “What then, Gautama?

source: སྡུག་བསྔལ་རང་གིས་མ་བགྱིས་པ་དང་། གཞན་གྱིས་མ་བགྱིས་པ་དང་། རྒྱུ་ལས་བྱུང་བ་ཡང་མ་ལགས་སམ།
en: If suffering is not created by itself, nor created by another, does it then not arise from a cause?”

source: འོད་སྲུང་འདི་ཡང་ངས་ལུང་མ་བསྟན་ཏོ། །
en: “ Kāśyapa , this too I have not proclaimed.”

source: གཽ་ཏ་མ་ཅི་ལགས།
en: “What then, Gautama?

source: སྡུག་བསྔལ་བདག་གིས་བགྱིས་པ་དང་གཞན་གྱིས་བགྱིས་པ་དང་། རྒྱུ་ལས་བྱུང་བ་ཡང་མ་ལགས། ཞེས་བགྱིས་པ་ཡང་ལུང་མ་བསྟན་ཏོ་ཞེས་གསུང་ངམ།
en: Aren’t you proclaiming that suffering is neither created by itself, nor created by another, nor arisen from a cause?”

source: འོད་སྲུང་སྡུག་བསྔལ་རང་གིས་བྱས་པ་དང་། གཞན་གྱིས་བྱས་པ་དང་། རྒྱུ་ལས་བྱུང་བ་ཡང་མ་ཡིན་ནམ། ཞེས་འདྲི་ན། ལུང་མ་བསྟན་ཏོ་ཞེས་ང་ཟེར་རོ། །
en: “ Kāśyapa , if you are asking whether suffering is created by itself, created by another, or whether or not it arises from a cause, my answer is that I did not proclaim this.”

source: སྡུག་བསྔལ་མ་མཆིས་པ་ཁོ་ན་ལགས་སམ།
en: Is there no such thing as suffering?”

source: འོད་སྲུང་སྡུག་བསྔལ་ནི་ཡེ་མེད་པ་མ་ཡིན་ཏེ།
en: “ Kāśyapa , it’s not that there is no suffering.

source: ཡོད་པ་ཁོ་ན་ཡིན་ནོ། །
en: It merely is.”

source: ཀྱེ་གཽ་ཏ་མ་སྡུག་བསྔལ་རང་གིས་བགྱིས་པ་ལགས་ན། ཅི་ནས་བདག་གིས་སྡུག་བསྔལ་ཤེས་པར་འགྱུར་བ་དང་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་བསྟན་པར་སྨོན་ཏོ། །
en: “Tell me, Gautama—if in fact suffering is self-created, can the Blessed One please teach me the Dharma by which I can come to know and see suffering?”

source: འོད་སྲུང་གང་གི་ཚེ། ཚོར་བ་ཡང་དེ་ཉིད་ཡིན་ལ། མྱོང་བ་ཡང་དེ་ཉིད་ཡིན་ན་ནི། དེ་ལྟ་ན་སྡུག་བསྔལ་རང་གིས་བྱས་པ་ཡིན་པར་འགྱུར་ན།
en: “ Kāśyapa , if sensation were self-existent, and experience were also self-existent, then suffering would be created by itself.

source: འོད་སྲུང་ང་ནི་དེ་སྐད་མི་ཟེར་རོ། །
en: But this is not what I proclaim, Kāśyapa.

source: འོད་སྲུང་གང་གི་ཚོར་བ་ཡང་གཞན་ཡིན་ལ་མྱོང་བ་ཡང་གཞན་ཡིན་ན་ནི། དེ་ལྟ་ན་སྡུག་བསྔལ་གཞན་གྱིས་བྱས་པ་ཡིན་པར་འགྱུར་ན།
en: “ Kāśyapa, if sensation were other than itself, and experience also other than itself, then suffering would be created by another.

source: འོད་སྲུང་གང་གི་ཚེ་ཚོར་བ་ཡང་དེ་ཉིད་ཡིན་ལ། མྱོང་བ་ཡང་དེ་ཉིད་ཡིན་པ་དང་། གང་གི་ཚེ་ཚོར་བ་ཡང་གཞན་ཡིན་ལ། མྱོང་བ་ཡང་གཞན་ཡིན་ན་ནི། དེ་ལྟ་ན་སྡུག་བསྔལ་རང་གིས་བྱས་པ་ཡང་ཡིན་ལ། གཞན་གྱིས་བྱས་པ་ཡང་ཡིན་པར་འགྱུར་ན
en: “ Kāśyapa , if sensation were self-existent, and experience also self-existent, and if at the same time sensation were other than itself, and experience likewise other than itself, then suffering would be created by itself and by another.

source: འོད་སྲུང་གང་གི་ཚེ་སྡུག་བསྔལ་རྐྱེན་རྣམས་མེད་པར་འགྱུར་ན་ནི། དེ་ལྟ་ན་སྡུག་བསྔལ་རང་གིས་བྱས་པ་དང་། གཞན་གྱིས་བྱས་པ་དང་། རྒྱུ་ལས་བྱུང་བ་ཡང་མ་ཡིན་པར་འགྱུར་ན
en: “ Kāśyapa , if there were no conditions for suffering, then suffering could not be created by itself, nor by another, nor would it arise from a cause.

source: དེ་བཞིན་གཤེགས་པ་ནི་མཐའ་དེ་གཉིས་ལ་མི་བརྟེན་པར། དབུ་མའི་ལམ་གྱི་ཆོས་སྟོན་ཅིང་འདི་ལྟ་སྟེ།
en: “The Tathāgata does not rely on the two extremes, but shows the Dharma of the middle way.

source: འདི་ཡོད་ན་འདི་འབྱུང་ལ།
en: If this is, that will occur.

source: འདི་སྐྱེས་པས་འདི་སྐྱེ་བར་འགྱུར་ཏེ།
en: This having arisen, that will arise.

source: འདི་ལྟ་སྟེ། མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་འབྱུང་།
en: “In this way, due to the condition of ignorance, there are formations.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་འབྱུང་།
en: Due to the condition of formations, there is consciousness.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས་འབྱུང་།
en: Due to the condition of consciousness, there are name and form.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག་འབྱུང་།
en: Due to the conditions of name and form, there are the six sense bases.

source: སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ་འབྱུང་།
en: Due to the condition of the six sense bases, there is contact .

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་འབྱུང་།
en: Due to the condition of contact , there is sensation.

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་འབྱུང་།
en: Due to the condition of sensation, there is craving .

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ་འབྱུང་།
en: Due to the condition of craving , there is grasping.

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ་འབྱུང་།
en: Due the condition of grasping, there is becoming .

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ་འབྱུང་།
en: Due to the condition of becoming , there is birth .

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ།
en: Due to the condition of birth , there is old age, death, sorrow, lamentation, suffering, unhappiness, and strife.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་འབྱུང་བར་འགྱུར་རོ། །
en: Thus does this entire great heap of suffering arise.

source: འདི་ལྟ་སྟེ། འདི་མེད་ན་འདི་མི་འབྱུང་ལ།
en: “So it is that without this, that will not occur.

source: འདི་འགགས་པས་འདི་འགག་པར་འགྱུར་ཏེ།
en: If this ceases, that will cease.

source: འདི་ལྟ་སྟེ། མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག །
en: In this way, due to the cessation of ignorance, formations cease.

source: འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག །
en: Due to the cessation of formations, consciousness will cease.

source: རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག །
en: Due to the cessation of consciousness, name and form will cease.

source: མིང་དང་གཟུགས་འགགས་པས་སྐྱེ་མཆེད་དྲུག་འགག །
en: Due to the cessation of name and form, the six sense bases will cease.

source: སྐྱེ་མཆེད་དྲུག་འགགས་པས་རེག་པ་འགག །
en: Due to the cessation of the six sense bases, contact will cease.

source: རེག་པ་འགགས་པས་ཚོར་བ་འགག །
en: Due to the cessation of contact , sensation will cease.

source: ཚོར་བ་འགགས་པས་སྲེད་པ་འགག །
en: Due to the cessation of sensation, craving will cease.

source: སྲེད་པ་འགགས་པས་ལེན་པ་འགག །
en: Due to the cessation of craving , grasping will cease.

source: ལེན་པ་འགགས་པས་སྲིད་པ་འགག །
en: Due to the cessation of grasping, becoming will cease.

source: སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག །
en: Due to the cessation of becoming, birth will cease.

source: སྐྱེ་བ་འགགས་པས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་རོ། །
en: Due to the cessation of birth , old age, death, sorrow, lamentation, suffering, unhappiness, and strife will cease.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་འགག་པར་འགྱུར་རོ། །
en: Thus does this entire great heap of suffering cease.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་། དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When he had explained this Dharma teaching, Nirgrantha Kinsman of the Kāśyapas was able to see these things unobscured, with the Dharma vision that has no trace of dust or stain with respect to phenomena.

source: དེ་ནས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས་ཆོས་མཐོང་།
en: Nirgrantha Kinsman of the Kāśyapas perceived the truths,

source: ཆོས་རྙེད་ཆོས་རྟོགས།
en: discovered the truths, realized the truths,

source: ཆོས་ཀྱི་གཏིང་སླེབས།
en: and fathomed the truths to their very depths,

source: སོམ་ཉི་ལས་བརྒལ་ཐེ་ཙོམ་ལས་བརྒལ་ཏེ།
en: until whatever doubts or hesitation he had he overcame.

source: གཞན་གྱི་དྲིང་མི་འཇོག་ཅིང་གཞན་གྱིས་བཀྲི་བ་མེད་ལ། སྟོན་པས་བསྟན་པའི་ཆོས་རྣམས་ལ། མི་འཇིགས་པ་ཐོབ་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, of his own accord, completely unprompted, and fearless on account of the truths his teacher had shown him, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and declared to the Blessed One,

source: བཙུན་པ་བདག་ནི་མངོན་པར་འཕགས་ལགས་སོ། །
en: “Lord, I have truly become a noble one.

source: མངོན་པར་ཞུགས་པ་ལགས་སོ།
en: I have truly gone forth.

source: བཙུན་པ་བདག་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིས་པ་དང་། ཆོས་ལ་སྐྱབས་སུ་མཆིས་པ་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིས་པ་ལགས་ཏེ།
en: Lord, I take refuge in the Blessed One, I take refuge in the Dharma, I take refuge in the Saṅgha.

source: བདག་དགེ་བསྙེན་ལགས་པར་གཟུང་དུ་གསོལ།
en: Please accept me as a lay vow holder,

source: བདག་མངོན་པར་དད་པར་གྱུར་ཏེ།
en: for I have truly come to faith.

source: དེང་སླན་ཅད་སྙིང་ཐག་པ་ནས་སྐྱབས་སུ་མཆིས་པ་ལགས་སོ་ཞེས་གསོལ་ནས།
en: From this day forth I take refuge with all my heart.”

source: དེ་ལྟར་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་ཅིང་། རྗེས་སུ་ཡི་རངས་ནས།
en: Nirgrantha Kinsman of the Kāśyapas rejoiced, praised all that the Blessed One had said,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: touched his head to the Blessed One’s feet, and took leave of him.

source: དེ་ནས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ནས། རིང་པོར་མ་ལོན་པར་བ་དྲུས་མ་ཞིག་གིས་བརྡུངས་ཏེ་བསད་ནས།
en: Not long after Nirgrantha Kinsman of the Kāśyapas had taken leave of the Blessed One, a milk cow kicked him and killed him.

source: དེ་འཆི་ཀར་དབང་པོ་རྣམས་དང་ཞིང་བཞིན་གྱི་མདོག་ཡོངས་སུ་དག་ལ། པགས་པའི་མདོག་དཀར་པོར་འདུག་གོ། །
en: At the time of his death his senses were clear, his appearance pure, and his complexion alabaster.

source: དེ་ནས་དགེ་སློང་མང་པོ་དག་སྔ་དྲོ་ཤམ་ཐབས་དང་། ཆོས་གོས་གྱོན་ནས། ལྷུང་བཟེད་ཐོགས་ཏེ། རྒྱལ་པོའི་ཁབ་ཏུ་བསོད་སྙོམས་ལ་དོང་ནས།
en: A group of monks donned their lower garments and Dharma robes, and, carrying their alms bowls, they set out toward Rājagṛha for alms.

source: གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས། ལམ་ཕྱེད་དེ་ཉིད་དུ་བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཞུས་ཏེ།
en: Along the way they heard that at the halfway point of the path Nirgrantha Kinsman of the Kāśyapas had asked questions of the Blessed One,

source: དེ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ནས་རིང་པོ་མ་ལོན་པར་བ་དྲུས་མས་བརྡུངས་ཏེ་བསད་ནས།
en: that not long after he had taken leave of the Blessed One a milk cow kicked him and killed him,

source: དེ་འཆི་ཀར་དབང་པོ་རྣམས་དང་ཞིང་བཞིན་གྱི་མདོག་ཀྱང་ཡོངས་སུ་དག་ལ། པགས་པའི་མདོག་དཀར་པོར་འདུག་གོ་ཞེས་ཐོས་སོ། །
en: and that at the time of his death his senses were clear, his appearance pure, and his complexion alabaster.

source: ཐོས་ནས་ཀྱང་རྒྱལ་པོའི་ཁབ་ནས་བསོད་སྙོམས་བླངས་ནས།
en: After they heard this the monks took alms in Rājagṛha and ate their meal.

source: ཟས་ཟོས་ཏེ་ཕྱིས་བསོད་སྙོམས་བླང་བ་སྤངས་ནས། ལྷུང་བཟེད་དང་ཆོས་གོས་བཞག་སྟེ། རྐང་པ་བཀྲུས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: Later, after they had finished taking alms, they put away their alms bowls and Dharma robes, washed their feet, and went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Upon their arrival they touched their heads to the Blessed One’s feet and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། དགེ་སློང་མང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once they had taken a seat at one side, the group of monks said to the Blessed One,

source: བཙུན་པ་འདི་ན་བདག་ཅག་དགེ་སློང་མང་པོ་སྔ་དྲོ་ཤམ་ཐབས་དང་། ཆོས་གོས་གྱོན་ཏེ། ལྷུང་བཟེད་ཐོགས་ནས། རྒྱལ་པོའི་ཁབ་ཏུ་བསོད་སྙོམས་ལ་མཆིས་པ་ན།
en: “Lord, we monks donned our lower garments and Dharma robes, and carrying our alms bowls set out toward Rājagṛha for alms.

source: བཙུན་པ་བདག་ཅག་དགེ་སློང་མང་པོ་རྒྱལ་པོའི་ཁབ་ཏུ་བསོད་སྙོམས་ལ་རྒྱུ་བ་རྣམས་ཀྱིས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པས་ཤུལ་ཕྱེད་དེ་ཉིད་དུ། བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཞུས་ནས།
en: Along the way we monks who were making our way to Rājagṛha for alms heard, Lord, that at the halfway point Nirgrantha Kinsman of the Kāśyapas had asked questions of the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ནས་རིང་པོ་མ་ལོན་པར་བ་དྲུས་མས་བརྡུངས་ཏེ་བཀུམ་ནས་
en: that not long after he had taken leave of the Blessed One a milk cow kicked him and killed him,

source: དེ་འགུམ་ཀར་དབང་པོ་རྣམས་དང་ཞིང་བཞིན་གྱི་མདོག་ཡོངས་སུ་དག་ལ། པགས་པའི་མདོག་དཀར་པོར་མཆིས་སོ་ཞེས་ཐོས་ལགས་ན།
en: and that at the time of his death his senses were clear, his appearance pure, and his complexion alabaster.

source: བཙུན་པ་དེའི་འགྲོ་བ་ནི་གང་ལགས།
en: Lord, what then was his destination?

source: སྐྱེ་བའི་གནས་ནི་གང་ལགས།
en: Into what state did he take birth?

source: འཆི་བའི་གནས་ནི་གང་ལགས།
en: In what state did he die?”

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་རིགས་ཀྱི་བུ་དེ་ནི་ནོར་དུ་གྱུར་པ་ཡིན་ཏེ
en: “Monks,” the Blessed One explained, “that noble child is a treasure.

source: དེས་ངའི་ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་མངོན་པར་རྟོགས་པས་ན།
en: The Dharma he realized proceeded from my own.

source: དེས་ནི་ང་ལ་གནོད་པ་མ་བྱས་ཀྱིས།
en: He did not harm me.

source: དགེ་སློང་དག་རིགས་ཀྱི་བུ་དེས་ནི་འདི་ལྟ་སྟེ། ཆོས་ལ་ལྷག་པར་བྱ་བ་བྱས་ནས། མྱ་ངན་ལས་འདས་ཀྱིས།
en: Monks, that noble child, having performed a singular good for the Dharma, attained nirvāṇa.

source: དེའི་རུས་བུ་ལ་རུས་བུའི་མཆོད་པ་གྱིས་ཤིག་ཅེས་བཀའ་སྩལ་ཏེ།
en: Therefore, you should perform a reliquary pūjā.”

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་མཆོག་ཏུ་གྱུར་པར་ལུང་བསྟན་ནས།
en: The Blessed One proclaimed Nirgrantha Kinsman of the Kāśyapas’ excellence,

source: རྒྱལ་པོའི་ཁབ་དེར་ལྷ་རྣམས་ཀྱིས་གཅེར་བུ་པ་འོད་སྲུང་དང་རུས་གཅིག་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་བསྒྲགས་སོ། །
en: and in Rājagṛha the gods declared that Nirgrantha Kinsman of the Kāśyapas had passed into parinirvāṇa.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་གཞན་མུ་སྟེགས་པ་རྣམས་ཀྱིས། རས་ཀྱི་བ་དན་བསྒྲེངས་ཏེ། ལམ་པོ་ཆེ་དང་སྲང་དང་། བཞི་མདོ་དང་། སུམ་མདོ་རྣམས་སུ་བསྒྲགས་ཏེ།
en: As soon as the extremists heard this they hoisted banners made of cotton, announcing on the highways, in the streets, at crossroads, and at forks in the road,

source: དགེ་སྦྱོང་གཽ་ཏ་མ་ན་རེ་ངའི་ཆོས་འདུལ་བ་འབའ་ཞིག་ལ་མཐར་ཐུག་པ་ཡོད་ཀྱིས།
en: “The ascetic Gautama claims that only his monastic discipline is comprehensive,

source: གཞན་ལ་མེད་དོ་ཞེ་ན།
en: that all others are not.

source: ངེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་འདི་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་
en: Yet by practicing our code of conduct this man has passed into parinirvāṇa!”

source: སྨྲས་ནས། །དེ་དག་དེའི་ཐད་དུ་དོང་སྟེ། འདིའི་རུས་བུ་ལ་མཆོད་པ་བྱའོ་སྙམ་མོ། །
en: After they said this, they went to venerate his relics.

source: དགེ་སློང་དག་ཀྱང་དེའི་ཐད་དུ་དོང་སྟེ། འདིའི་རུས་བུ་ལ་མཆོད་པ་བྱའོ་སྙམ་མོ། །དེ་ནས་དེར་མུ་སྟེགས་པ་ཀུན་ཏུ་རྒྱུ་བ་རྣམས་ན་རེ་འདི་ནི་
en: The monks also went with the intention of venerating his relics, but the extremist mendicants told them,

source: བདག་ཅག་གི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་གྱིས།
en: “He was a fellow practitioner of our code of conduct.

source: བདག་ཅག་གིས་འདིའི་རུས་བུ་ལ་མཆོད་པ་བྱའོ་ཞེས་ཟེར་རོ། །
en: Therefore, it is we who should perform the reliquary pūjā.”

source: དགེ་སློང་དག་ན་རེ་ཡང་འདི་ནི་བདག་ཅག་གི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་གྱིས།
en: “He was a fellow practitioner of our code of conduct,” the monks replied.

source: དེ་ནས་གཞན་མུ་སྟེགས་པ་ཀུན་ཏུ་རྒྱུ་བ་དག་ན་རེ། བདག་ཅག་གིས་དབང་པོ་ནི་ལྷ་གང་དག་གིས་རྒྱལ་པོའི་ཁབ་འདིར་བསྒྲགས་པ་ཡིན་ནོ་ཞེས་ཟེར་རོ། །
en: “We have as our witnesses the gods who declared it in Rājagṛha,” said the extremist mendicants.

source: དགེ་སློང་དག་ན་རེ་ཡང་འདི་སུའི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་པ། ལྷ་དེ་དག་ཉིད་ལ་དྲི་བར་བྱའོ་ཞེས་ཟེར་རོ། །
en: “Let us ask the gods whose code of conduct he practiced,” proposed the monks.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་གཞན་མུ་སྟེགས་པ་ཀུན་ཏུ་རྒྱུ་བ་དེ་དག་གིས། ལྷ་དེ་དག་ཉིད་ལ་གསོལ་བ་བཏབ་སྟེ། འདི་སུའི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་པ་དང་། སུའི་མ་ཡིན་པ་དེ་ལྷ་རྣམས་གསུངས་ཤིག་ཅེས་བྱས་སོ། །
en: The extremist mendicants immediately began to supplicate the gods, petitioning them, “Devas, may you tell us whose code of conduct he practiced, and whose he did not.”

source: དེ་ནས་ཆོས་རྟོགས་པའི་ལྷ་རྣམས་ན་རེ།
en: The gods accomplished in the Dharma replied,

source: འདི་ནི་དགེ་སློང་རྣམས་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཏེ།
en: “He practiced the monks’ code of conduct.

source: འདིས་བཅོམ་ལྡན་འདས་ལས་ཆོས་རྟོགས་ནས།
en: Through the Blessed One he realized the Dharma.

source: དེས་ན་འདི་བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ། །
en: Thus, in the intermediate state between death and rebirth he passed into parinirvāṇa.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་གཞན་མུ་སྟེགས་པ་ཀུན་ཏུ་རྒྱུ་རྣམས་སྐྱེངས་ནས་ས་ཕྱོགས་དེ་ནས་དོང་ངོ་། །
en: The extremist mendicants left the area in embarrassment as soon as they heard this.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེའི་རུས་བུ་རྣམས་ལ་རུས་བུའི་མཆོད་པ་བྱས་ཏེ། འོད་མའི་ཚལ་དུ་དོང་ནས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: After the monks performed Nirgrantha Kinsman of the Kāśyapas’ reliquary pūjā, they went to Bamboo Grove and inquired of the Blessed One,
